
 

IDENTIFICATION DIVISION.

PROGRAM-ID. ESEMPIO-SEQUENZIALE.

AUTHOR. MAURIZIO BOTTO.

INSTALLATION. NANOLINUX IV, TINYCOBOL 0.61.

DATE-WRITTEN. 2005-02-16.

ENVIRONMENT DIVISION.

INPUT-OUTPUT SECTION.

*

FILE-CONTROL.

SELECT FILE-NAME ASSIGN TO DISK

ORGANIZATION IS SEQUENTIAL

ACCESS MODE IS SEQUENTIAL

FILE STATUS IS DATA-NAME.

*

DATA DIVISION.

FILE SECTION.

FD FILE-NAME

LABEL RECORD IS STANDARD

VALUE OF FILE-ID IS "input.seq".

01 RECORD-NAME PIC X(20).

WORKING-STORAGE SECTION.

01 DATA-NAME PIC XX.

PROCEDURE DIVISION.

MAIN.

OPEN INPUT FILE-NAME.

DISPLAY "FILE STATUS: ", DATA-NAME.



PERFORM READ-FILE UNTIL DATA-NAME NOT = ZERO.

CLOSE FILE-NAME.

STOP RUN.

READ-FILE.

READ FILE-NAME.

READ-FILE-EX.

EXIT.

STOP-RUN.
