IDENTIFICATION DIVISION.
PROGRAM-ID.    NUMDIP.
ENVIRONMENT DIVISION.
SOURCE-COMPUTER. PC - DOS.
OBJECT-COMPUTER. PC - DOS.
SPECIAL-NAMES.
INPUT-OUTPUT SECTION.
FILE-CONTROL.
    SELECT FL-1 ASSIGN TO DISK.
    SELECT STAT IS ASSIGN TO PRINTER.

DATA DIVISION.
FILE SECTION.
FD  FL-1 
    LABEL RECORD IS OMITTED
    DATA RECORD IS RILEVAZ
01  RILEVAZ.
    02 ITSK     PIC XX.
    02 SOC      PIC X.
    02 REP      PIC XX.
    02 MATR     PIC X(5).
    02 FILLER   PIC X(27).
    02 MM       PIC 99.
    02 AA       PIC 99.
    02 SESSO    PIC 9.

FD  STATIS
    LABEL RECORD IS OMITTED
    DATA RECORD  IS RIGA.
01  RIGA.
    02 ZONA-ST.
       03 FILLER PIC X(2).
       03 SOC-ST PIC X.
    02 FILLER    PIC X(2).
    02 REP-ST    PIC X(2).
    02 FILLER    PIC X(4).
    02 TOT-MS-T  PIC 9(4).
    02 FILLER    PIC X(2).
    02 TOT-M50-ST PIC 9(4).
    02 FILLER     PIC X(4).
    02 TOT-IF-ST  PIC 9(4).
    02 FILLER     PIC X(2).
    02 TOT-F40-ST  PIC 9(4).

WORKING-STORAGE SECTION.
77  CTR            PIC 9(2) VALUE 50.
77  DSOG           PIC XX.
77  DREP           PIC X(2).
01  TOTALI.
    02  TOTR.
        03 TOT-M-R PIC 9(4).
        03 TOT-M50-R PIC 9(4).
        03 TOT-F-R PIC 9(4). 
        03 TOT-F40-R PIC 9(4).     
    02  TOTS.
        03 TOT-M-R PIC 9(4).
        03 TOT-M50-R PIC 9(4).
        03 TOT-F-R PIC 9(4). 
        03 TOT-F40-R PIC 9(4).  
    02  TOTG.
        03 TOT-M-G PIC 9(4).
        03 TOT-M50-G PIC 9(4).
        03 TOT-F-G PIC 9(4). 
        03 TOT-F40-G PIC 9(4).        
01  SKD.
    02  TS  PIC X.
    02  MM-TEST PIC 99.
    02  AA-TEST PIC 99.
01  A1  PIC 99.

PROCEDURE DIVISION.
PROG-PRINC SECTION.
    PERFORM N-PROG
    PERFORM LETT-RIC.
INIZIO-S.
    PERFORM N-SOC.
INIZIO-R.
    PERFORM N-REP.
TRATTAMENTO.
    PERFORM TRATT
    PERFORM LETT-RIC
    IF DSOC NOT = SOC GO TO CONTINUA1.
    IF DREP = REP GO TO TRATTAMENTO.
    PERFORM FINE-REP
    GO TO INIZIO-R.
CONTINUA1.
    PERFORM FINE-REP
    PERFORM FINE-SOC
    IF SOC NOT =  HIGH-VALUE GO TO INIZIO-S.
    PERFORM FINE-PROG
    STOP RUN.
IN-PROG SECTION.
    ACCEPT SKD IF TS NOT = "D" GO TO IN-PROG.
    OPEN INPUT FL-1
    OPEN OUTPUT STATIS
    MOVE SPACE TO RIGA
    MOVE ZERO TO TOTALI.

LETT-RIC SECTION.
    READ FL-1 AT END MOVE HIGH-VALUE TO SOC.
    GO TO USCITA-LETT-RIC.
    IF TSK NOT = 
     "105" GO TO LETT-RIC.
USCITA-LETT-RIC. 
    EXIT.
IN-SOC SECTION.
    MOVE SOC TO DSOC.
IN-REP SECTION.
    MOVE REP TO DREP.

TRATT SECTION.
    IF SESSO = 1 SUBTRACT 50 FROM AA-TEST GIVING A1
    ADD 1 TO TOT-M-R
    ELSE SUBTRACT 40 TO FROM AA-TEST GIVING A1
    ADD 1 TO TOT-F-R.
    IF  AA < A1 GO TO USCITA-TRATT.
    IF  AA NOT = A1 GO TO X.
    IF  MM NOT > MM-TEST GO TO USCITA-TRATT.
    IF  SESSO = 1 ADD 1 TO TOT-M50-READ
        ELSE ADD 1 TO F40-R.
USCITA-TRATT EXIT.

FINE-REP SECTION.
    ADD 1 TO CTR
    IF CTR > 50 WRITE RIGA AFTER SALTO
       MOVE 1 TO CTR.
    MOVE DISOC TO SOC-ST
    MOVE DREP  TO REP-ST
    MOVE TOT-M-R TO TOT-M-ST
    MOVE TOT-M50-R TO TOT-M50-ST
    MOVE TOT-F-R TO TOT-F-ST
    MOVE TOT-F40-R TO TOT-F40-ST
    WRITE RIGA BEFORE 1 LINE
    MOVE SPACE TO RIGA
    ADD TOT-M-R TO TOT-M-S
    ADD TOT-M50-R TO TOT-M50-S
    ADD TOT-F-R TO TOT-F-S
    ADD TOT-F40-R TO TOT-F40-S
    MOVE ZERO TO TOT-R.

FINE-SOC SECTION.
    MOVE DSOC TO SOC-S
    MOVE TOT-M-S TO TOT-M-ST
    MOVE TOT-M50-S TO TOT-M50-ST
    MOVE TOT-F-S TO TOT-F-ST
    MOVE TOT-F40-ST TO TOT-F40-ST
    WRITE RIGA BEFORE 1 LINE
    MOVE SPACE TO RIGA
    ADD TOT-M-S TO TOT-M-G
    ADD TOT-M50-S TO TOT-M50-G
    ADD TOT-F-S TO TOT-F-G
    ADD TOT-F40-S TO TOT-F40-G
    MOVE ZERO TO TOT-G
    MOVE 50 TO CTR.

FINE-PROG SECTION.
    MOVE "***" TO ZONA-ST
    MOVE TOT-M-G TO TOT-M-S
    MOVE TOT-M50-G TO TOT-M50-ST
    MOVE TOT-F-G TO TOT-F-ST
    MOVE TOT-F40-G TO TOT-F40-ST
    WRITE RIGA AFTER SALTO
    CLOSE FL-1 STATUS.
    





