      *****************************************************************
      * COPYBOOK BMS OUTPUT
      * MAPPA : MAPVISU
      * MAPSET: POLMAP
      *****************************************************************

       01 MAPVISUO.

           05 FILLER            PIC X(12).

      *---------------------------------------------------------*
      * CODICE POLIZZA
      *---------------------------------------------------------*

           05 VICODOL           PIC S9(4) COMP.
           05 VICODOF           PIC X.
           05 VICODOA           PIC X.
           05 VICODOO           PIC X(10).

      *---------------------------------------------------------*
      * NOME CLIENTE
      *---------------------------------------------------------*

           05 VINOMEL           PIC S9(4) COMP.
           05 VINOMEF           PIC X.
           05 VINOMEA           PIC X.
           05 VINOMEO           PIC X(40).

      *---------------------------------------------------------*
      * INDIRIZZO
      *---------------------------------------------------------*

           05 VIINDIL           PIC S9(4) COMP.
           05 VIINDIF           PIC X.
           05 VIINDIA           PIC X.
           05 VIINDIO           PIC X(50).

      *---------------------------------------------------------*
      * IMPORTO
      *---------------------------------------------------------*

           05 VIIMPOL           PIC S9(4) COMP.
           05 VIIMPOF           PIC X.
           05 VIIMPOA           PIC X.
           05 VIIMPOO           PIC X(12).

      *---------------------------------------------------------*
      * SCADENZA
      *---------------------------------------------------------*

           05 VISCADL           PIC S9(4) COMP.
           05 VISCADF           PIC X.
           05 VISCADA           PIC X.
           05 VISCADO           PIC X(10).

      *---------------------------------------------------------*
      * SIGLA AUTO
      *---------------------------------------------------------*

           05 VISIGAL           PIC S9(4) COMP.
           05 VISIGAF           PIC X.
           05 VISIGAA           PIC X.
           05 VISIGAO           PIC X(10).

      *---------------------------------------------------------*
      * NUMERO CAVALLI
      *---------------------------------------------------------*

           05 VICAVAL           PIC S9(4) COMP.
           05 VICAVAF           PIC X.
           05 VICAVAA           PIC X.
           05 VICAVAO           PIC X(4).

      *---------------------------------------------------------*
      * MESSAGGIO
      *---------------------------------------------------------*

           05 VIMSGL            PIC S9(4) COMP.
           05 VIMSGF            PIC X.
           05 VIMSGA            PIC X.
           05 VIMSGO            PIC X(70).
