IDENTIFICATION DIVISION.
PROGRAM-ID. RECPAG.

DATA DIVISION.

WORKING-STORAGE SECTION.

01 WS-COD-POL      PIC X(10).
01 WS-MSG          PIC X(50).

EXEC SQL
 INCLUDE SQLCA
END-EXEC.

PROCEDURE DIVISION.

MAIN-PARA.

    EXEC CICS RECEIVE
         MAP('MAPREC')
         MAPSET('POLMAP')
    END-EXEC

    EXEC SQL
      SELECT COD_POLIZZA
      INTO :WS-COD-POL
      FROM POLIZZE
      WHERE COD_POLIZZA = :WS-COD-POL
    END-EXEC

    IF SQLCODE = 100

       MOVE 'ERRORE NELLA CHIAVE'
            TO WS-MSG

    ELSE

       EXEC SQL
         UPDATE POLIZZE
            SET STATO_PAGAMENTO = 'P',
                DATA_PAGAMENTO  = CURRENT DATE
          WHERE COD_POLIZZA = :WS-COD-POL
       END-EXEC

       MOVE 'PAGAMENTO REGISTRATO'
            TO WS-MSG

    END-IF

    EXEC CICS SEND
         MAP('MAPREC')
         MAPSET('POLMAP')
    END-EXEC

    EXEC CICS RETURN
    END-EXEC.
