EXEC SQL OPEN C-AVVISI END-EXEC.

PERFORM UNTIL SQLCODE = 100

   EXEC SQL
      FETCH C-AVVISI
      INTO
         :COD-POLIZZA,
         :NOME-CLIENTE,
         :IMPORTO
   END-EXEC

END-PERFORM.

EXEC SQL CLOSE C-AVVISI END-EXEC.
