IDENTIFICATION DIVISION.
PROGRAM-ID. VISUPOL.

DATA DIVISION.

WORKING-STORAGE SECTION.

COPY DFHAID.
COPY DFHBMSCA.

COPY MAPVISU.
COPY MAPVISUI.

EXEC SQL
   INCLUDE SQLCA
END-EXEC.

PROCEDURE DIVISION.

MAIN.

    EXEC CICS RECEIVE
         MAP('MAPVISU')
         MAPSET('POLMAP')
    END-EXEC

    MOVE VICODOI TO HV-CODICE

    EXEC SQL
       SELECT ...
    END-EXEC

    MOVE HV-NOME TO VINOMEO

    EXEC CICS SEND
         MAP('MAPVISU')
         MAPSET('POLMAP')
    END-EXEC

    EXEC CICS RETURN
    END-EXEC.
