PRDMAP   DFHMSD TYPE=&SYSPARM,
               MODE=INOUT,
               LANG=COBOL,
               STORAGE=AUTO,
               TERM=3270

PRDMAP   DFHMDI SIZE=(24,80),
               LINE=1,
               COLUMN=1

*
* Titolo
*
TITLE    DFHMDF POS=(1,25),
               LENGTH=20,
               ATTRB=(PROT,BRT),
               INITIAL='RICERCA PRODOTTI'

*
* Campo Input
*
LBLCOD   DFHMDF POS=(5,2),
               LENGTH=18,
               ATTRB=(PROT),
               INITIAL='Codice Prodotto'

CODCLI   DFHMDF POS=(5,25),
               LENGTH=5,
               ATTRB=(UNPROT,IC)

*
* Campi Output
*
LBLDES   DFHMDF POS=(7,2),
               LENGTH=12,
               ATTRB=(PROT),
               INITIAL='Descrizione'

DESCR    DFHMDF POS=(7,25),
               LENGTH=30,
               ATTRB=(PROT)

LBLPRE   DFHMDF POS=(9,2),
               LENGTH=8,
               ATTRB=(PROT),
               INITIAL='Prezzo'

PREZZO   DFHMDF POS=(9,25),
               LENGTH=10,
               ATTRB=(PROT)

LBLSCO   DFHMDF POS=(11,2),
               LENGTH=14,
               ATTRB=(PROT),
               INITIAL='Scorta Minima'

SCORTA   DFHMDF POS=(11,25),
               LENGTH=3,
               ATTRB=(PROT)

MESSAGG  DFHMDF POS=(20,2),
               LENGTH=50,
               ATTRB=(PROT,BRT)

          DFHMSD TYPE=FINAL
          END
