     A          R CLIREC
     A            CLICOD         6A         TEXT('Codice Cliente')
     A            CLINOME       30A         TEXT('Nome')
     A            CLICOGN       30A         TEXT('Cognome')
     A            CLIINDIR      40A         TEXT('Indirizzo')
     A            CLICITTA      20A         TEXT('Citta')
     A            CLICAP         5S 0       TEXT('CAP')
     A            CLIPROV        2A         TEXT('Provincia')
     A            CLITEL        15A         TEXT('Telefono')
     A            CLIEMAIL      50A         TEXT('Email')
     A            CLICF         16A         TEXT('Codice Fiscale')
     A            CLIRESID      40A         TEXT('Residenza')
     A            CLIDTNAS       8S 0       TEXT('Data Nascita')
     A            CLILUNAS      30A         TEXT('Luogo Nascita')
     A            CLISTATO       1A         TEXT('Stato')
     A          K CLICOD
