      A          R CLIFMT
     A                                  CF03(03)
     A            CLICOD         6A  B  3 20
     A            CLINOME       30A  B  5 20
     A            CLICOGN       30A  B  7 20
     A            CLIINDIR      40A  B  9 20
     A            CLICITTA      20A  B 11 20
     A            CLITEL        15A  B 13 20
     A            CLICF         16A  B 15 20
     A            CLIRESID      40A  B 17 20
