OPEN I-O ARTICOLI

PERFORM UNTIL CODART = 0

   DISPLAY "CODICE ARTICOLO"
   ACCEPT CODART

   IF CODART NOT = 0

      DISPLAY "DESCRIZIONE"
      ACCEPT DESART

      DISPLAY "PREZZO"
      ACCEPT PRZART

      DISPLAY "IMPORTO UNITARIO"
      ACCEPT IMPUNIT

      DISPLAY "QUANTITA"
      ACCEPT QUANTART

      WRITE REC-ART

   END-IF

END-PERFORM

CLOSE ARTICOLI
STOP RUN.
