OPEN INPUT ARTICOLI

DISPLAY "ELENCO ARTICOLI"

READ ARTICOLI
   AT END MOVE "S" TO EOF

PERFORM UNTIL EOF = "S"

   DISPLAY CODART " "
           DESART " "
           IMPUNIT " "
           QUANTART

   READ ARTICOLI
      AT END MOVE "S" TO EOF

END-PERFORM

CLOSE ARTICOLI
STOP RUN.
