OPEN I-O ARTICOLI

PERFORM UNTIL CODART = 0

   DISPLAY "CODICE DA VARIARE"
   ACCEPT CODART

   IF CODART NOT = 0

      READ ARTICOLI
         INVALID KEY
            DISPLAY "ARTICOLO INESISTENTE"

         NOT INVALID KEY

            DISPLAY "NUOVA DESCRIZIONE"
            ACCEPT DESART

            DISPLAY "NUOVO PREZZO"
            ACCEPT PRZART

            DISPLAY "NUOVO IMPORTO"
            ACCEPT IMPUNIT

            DISPLAY "NUOVA QUANTITA"
            ACCEPT QUANTART

            REWRITE REC-ART

      END-READ
   END-IF

END-PERFORM

CLOSE ARTICOLI
STOP RUN.
