OPEN INPUT ARTICOLI

PERFORM UNTIL CODART = 0

   DISPLAY "CODICE ARTICOLO"

   ACCEPT CODART

   IF CODART NOT = 0

      READ ARTICOLI

         INVALID KEY
            DISPLAY "INESISTENTE"

         NOT INVALID KEY

            DISPLAY CODART
            DISPLAY DESART
            DISPLAY PRZART
            DISPLAY IMPUNIT
            DISPLAY QUANTART

      END-READ

   END-IF

END-PERFORM

CLOSE ARTICOLI
STOP RUN.
