IDENTIFICATION DIVISION.
PROGRAM-ID. MENUART.

DATA DIVISION.

WORKING-STORAGE SECTION.

01 SCELTA PIC 9.

PROCEDURE DIVISION.

MAIN.

   PERFORM UNTIL SCELTA = 0

      DISPLAY " "
      DISPLAY "GESTIONE MAGAZZINO"
      DISPLAY "1 CARICAMENTO ARTICOLI"
      DISPLAY "2 VARIAZIONE ARTICOLI"
      DISPLAY "3 VISUALIZZAZIONE ARTICOLI"
      DISPLAY "4 STAMPA ARTICOLI"
      DISPLAY "5 INSERIMENTO ORDINI"
      DISPLAY "6 STAMPA ORDINI"
      DISPLAY "0 FINE"

      ACCEPT SCELTA

      EVALUATE SCELTA

         WHEN 1
              CALL "ARTCAR"

         WHEN 2
              CALL "ARTVAR"

         WHEN 3
              CALL "ARTVISU"

         WHEN 4
              CALL "ARTSTA"

         WHEN 5
              CALL "ORDINS"

         WHEN 6
              CALL "ORDSTA"

      END-EVALUATE

   END-PERFORM

   STOP RUN.
