OPEN OUTPUT ORDINI

PERFORM UNTIL CODCLI = 0

   DISPLAY "CODICE CLIENTE"
   ACCEPT CODCLI

   IF CODCLI NOT = 0

      DISPLAY "NOME"
      ACCEPT NOME

      DISPLAY "INDIRIZZO"
      ACCEPT INDIRIZZO

      DISPLAY "IMPORTO UNITARIO"
      ACCEPT IMPUNI

      DISPLAY "QUANTITA"
      ACCEPT QTA

      DISPLAY "DESCRIZIONE"
      ACCEPT DESCRIZ

      MOVE "A" TO STATOORD

      WRITE REC-ORD

   END-IF

END-PERFORM

CLOSE ORDINI
STOP RUN.
