IDENTIFICATION DIVISION.
PROGRAM-ID. ORDSTA.

ENVIRONMENT DIVISION.

INPUT-OUTPUT SECTION.

FILE-CONTROL.

    SELECT ORDINI ASSIGN TO ORDINI.
    SELECT ARTICOLI ASSIGN TO ARTICOLI.

DATA DIVISION.

FILE SECTION.

FD ORDINI.

01 REC-ORD.
   05 CODCLI      PIC 9(5).
   05 NOME        PIC X(25).
   05 INDIRIZZO   PIC X(30).
   05 IMPUNI      PIC 9(4)V99.
   05 QTA         PIC 9(4).
   05 DESCRIZ     PIC X(14).
   05 STATOORD    PIC X.

FD ARTICOLI.

01 REC-ART.
   05 CODART      PIC 9(5).
   05 DESART      PIC X(25).
   05 PRZART      PIC 9(6).
   05 IMPUNIT     PIC 9(4)V99.
   05 QUANTART    PIC 9(6).

WORKING-STORAGE SECTION.

01 EOF-ORD PIC X VALUE "N".
01 EOF-ART PIC X VALUE "N".

01 TOTRIGA PIC 9(7)V99.

PROCEDURE DIVISION.

MAIN.

    OPEN INPUT ORDINI
    OPEN INPUT ARTICOLI

    DISPLAY " "
    DISPLAY "ELENCO ORDINI CLIENTI"
    DISPLAY " "

    READ ORDINI
       AT END MOVE "S" TO EOF-ORD

    PERFORM UNTIL EOF-ORD = "S"

       COMPUTE TOTRIGA = QTA * IMPUNI

       DISPLAY "------------------------------------"
       DISPLAY "CLIENTE    : " CODCLI
       DISPLAY "NOME       : " NOME
       DISPLAY "INDIRIZZO  : " INDIRIZZO
       DISPLAY "ARTICOLO   : " DESCRIZ
       DISPLAY "QUANTITA   : " QTA
       DISPLAY "IMPORTO U. : " IMPUNI
       DISPLAY "TOTALE     : " TOTRIGA
       DISPLAY "------------------------------------"

       READ ORDINI
          AT END MOVE "S" TO EOF-ORD

    END-PERFORM

    CLOSE ORDINI
    CLOSE ARTICOLI

    STOP RUN.
